Tekla Open API Reference for Tekla Structures 2025
FacetedBrep.GetOuterFace Method
 Gets the outer face at the specified index.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int[] GetOuterFace(
	int faceIndex
)
Public Function GetOuterFace (
	faceIndex As Integer
) As Integer()
Parameters
faceIndex
Type: System.Int32
The index of the face.
Return Value
Type: Int32[]
The array of vertex indexes for the outer face.
See Also
Reference
FacetedBrep Class
Tekla.Structures.Geometry3d Namespace